#+TITLE: dotfiles
** Pacman

List all installed packages:

#+BEGIN_SRC sh :results ouput
pacman -Qqe
#+END_SRC

#+RESULTS:
| alsa-utils                    |
| aspell                        |
| aspell-en                     |
| autoconf                      |
| automake                      |
| bash                          |
| binutils                      |
| bison                         |
| bluez                         |
| bluez-utils                   |
| bspwm                         |
| bzip2                         |
| clang                         |
| compton                       |
| coreutils                     |
| cryptsetup                    |
| device-mapper                 |
| dhcpcd                        |
| diffutils                     |
| discord                       |
| e2fsprogs                     |
| emacs-git                     |
| fakeroot                      |
| fasd                          |
| fd                            |
| feh                           |
| file                          |
| filesystem                    |
| findutils                     |
| firefox                       |
| fish                          |
| flex                          |
| gawk                          |
| gcc                           |
| gcc-libs                      |
| gettext                       |
| git                           |
| glibc                         |
| graphviz                      |
| grep                          |
| groff                         |
| grub                          |
| gzip                          |
| htop                          |
| hugo                          |
| inetutils                     |
| iproute2                      |
| iputils                       |
| isync                         |
| jfsutils                      |
| languagetool                  |
| less                          |
| libtool                       |
| licenses                      |
| linux                         |
| logrotate                     |
| lvm2                          |
| m4                            |
| make                          |
| man-db                        |
| man-pages                     |
| mdadm                         |
| minted                        |
| msmtp                         |
| msmtp-mta                     |
| nano                          |
| neofetch                      |
| neovim                        |
| netctl                        |
| networkmanager                |
| notmuch                       |
| octave                        |
| offlineimap-git               |
| openssh                       |
| openssl                       |
| pacman                        |
| pandoc                        |
| pass                          |
| patch                         |
| pciutils                      |
| perl                          |
| pinentry-rofi                 |
| pkgconf                       |
| polybar-git                   |
| poppler-glib                  |
| procps-ng                     |
| psmisc                        |
| pulseaudio                    |
| pulseaudio-alsa               |
| pulseaudio-bluetooth          |
| pygmentize                    |
| python                        |
| python-matplotlib             |
| python-numpy                  |
| python-pipenv                 |
| reiserfsprogs                 |
| ripgrep-git                   |
| rofi                          |
| rofi-pass                     |
| rxvt-unicode-patched          |
| s-nail                        |
| screenkey-git                 |
| scrot                         |
| sed                           |
| shadow                        |
| simplescreenrecorder-git      |
| sudo                          |
| sxhkd                         |
| sysfsutils                    |
| systemd                       |
| systemd-sysvcompat            |
| tar                           |
| texinfo                       |
| texlive-core                  |
| texlive-latexextra            |
| ttf-iosevka-term              |
| ttf-roboto-mono               |
| usbutils                      |
| util-linux                    |
| vi                            |
| vim                           |
| virtualbox-guest-modules-arch |
| virtualbox-guest-utils        |
| vlc                           |
| which                         |
| xclip                         |
| xfsprogs                      |
| xkb-switch-git                |
| xorg-bdftopcf                 |
| xorg-iceauth                  |
| xorg-luit                     |
| xorg-mkfontdir                |
| xorg-mkfontscale              |
| xorg-server                   |
| xorg-sessreg                  |
| xorg-setxkbmap                |
| xorg-smproxy                  |
| xorg-x11perf                  |
| xorg-xauth                    |
| xorg-xbacklight               |
| xorg-xcmsdb                   |
| xorg-xcursorgen               |
| xorg-xdpyinfo                 |
| xorg-xdriinfo                 |
| xorg-xev                      |
| xorg-xgamma                   |
| xorg-xhost                    |
| xorg-xinit                    |
| xorg-xinput                   |
| xorg-xkbcomp                  |
| xorg-xkbevd                   |
| xorg-xkbutils                 |
| xorg-xkill                    |
| xorg-xlsatoms                 |
| xorg-xlsclients               |
| xorg-xmodmap                  |
| xorg-xpr                      |
| xorg-xprop                    |
| xorg-xrandr                   |
| xorg-xrdb                     |
| xorg-xrefresh                 |
| xorg-xset                     |
| xorg-xsetroot                 |
| xorg-xvinfo                   |
| xorg-xwd                      |
| xorg-xwininfo                 |
| xorg-xwud                     |
| yay                           |
| zsh                           |
| zsh-completions               |
